# 사용자가 일정 구간의 값을 입력할 때까지 사용자에게 입력을 요청하는
# 함수 getIntRange(a, b, msg)를 작성하고 테스트하라.
# 날짜(월, 일)를 입력받아서 출력한다.

# 실행 결과
"""
날짜를 입력하십시오(월과 일)
월을 입력하시오(1부터 12사이의 값): 13
월을 입력하시오(1부터 12사이의 값): 1
일을 입력하시오(1부터 31사이의 값): 32
일을 입력하시오(1부터 31사이의 값): 3

입력된 날짜는 1월 3일입니다.
"""

def getIntRange(a, b, msg):
    while True:
        num = int(input(msg))

        if a <= num <= b:
            return num

print("날짜를 입력하십시오(월과 일)")

month = getIntRange(1, 12, "월을 입력하시오(1부터 12사이의 값): ")
day = getIntRange(1, 31, "일을 입력하시오(1부터 31사이의 값): ")

print(f"입력된 날짜는 {month}월 {day}일입니다.")